APC10x4.5Static/5425RPM/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [m^2 s^-3];

internalField   uniform 0.14; // Initial value is determined by approximate values for flow speed, see report

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet; // inlet dissipation rate determined in part by mixing length, taken to be 0.075*propeller diameter
        mixingLength    0.01875;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet; // Zero gradient for exiting flow, no incoming flow
        inletValue      $internalField;
        value           $internalField;
    }

    walls
    {
        type            zeroGradient; // Zero gradient far from propeller
    }

    hub
    {
        type            epsilonWallFunction; // Wall function at solid surface
        value           $internalField;
    }

    symY
    {
        type            cyclic;
    }

    symZ
    {
        type            cyclic;
    }

    /* symY
    {
        type            symmetryPlane;
    }

    symZ
    {
        type            symmetryPlane;
    } */
}


// ************************************************************************* //
