APC10x4.5Static/5425RPM/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

disk // Create an object
{
    type            actuatorDiskForce; // Class type

    fields          (U);    // Names of fields on which to apply source. Should only be U.
    startPoint      (0 0 0); // Starting point for cylinder axis
    endPoint		(0.01 0 0); // Ending point for cylinder axis. Cylinder is centered on x-axis and is 1 cm long.
    interiorRadius	0.008; // Hub radius
    exteriorRadius	0.127; // Propeller radius

    Ct      0.154; // Coefficients and RPM
    Cp      0.057;
    rpm     5425;

    selectionMode   geometric; // Specification of propeller geometry.
    selection
    {
        rotor
        {
            action      add;
            source      cylinder;
            p1          $startPoint;
            p2          $endPoint;
            radius      $exteriorRadius;
            innerRadius $interiorRadius;
        }
    } 
}


// ************************************************************************* //
